cases/incompressible/interpolatingSolidBody/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// ************************************************************************* //

#include "./initialConditions"

transportModel  Newtonian;

nuVal           #calc "$muVal / $rhoVal";

nu              [0 2 -1 0 0 0 0] $nuVal;

// ************************************************************************* //
