cases/incompressible/interpolatingSolidBody/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "./initialConditions"

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         $iterations;    

deltaT          1e-5;

writeControl    adjustableRunTime;

writeInterval   $writeEvery;

purgeWrite      0;

writeFormat     ascii;

writePrecision   10;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true; 

adjustTimeStep  yes;

maxCo           0.9;

functions
{
    #include "functions/residuals"
    #include "functions/yPlus"
    #include "functions/forceCoeffs"
}

// ************************************************************************* //
